{
    "entities": [
        {
            "entity": "ETLKPAR",
            "description": "Designation code for indicating there is nobody to talk to about serious problems."
        },
        {
            "entity": "YETLKNON",
            "description": "Survey item asking if there's nobody the respondent can talk to about serious problems."
        },
        {
            "entity": "YETLKPAR",
            "description": "Survey item asking if the respondent can talk to their mother or father about serious problems."
        },
        {
            "entity": "YETLKBGF",
            "description": "Survey item asking if the respondent can talk to their boyfriend or girlfriend about serious problems."
        },
        {
            "entity": "YETLKOTA",
            "description": "Survey item asking if the respondent can talk to some other adult about serious problems."
        },
        {
            "entity": "YETLKSOP",
            "description": "Survey item asking if the respondent can talk to some other person about serious problems."
        },
        {
            "entity": "Response",
            "description": "The type of response entered by the survey participant."
        },
        {
            "entity": "ResponseNotEntered",
            "description": "Indicator that a response was not entered by the survey participant."
        },
        {
            "entity": "ResponseCodes",
            "description": "Specific response codes used to categorize the type of response entered."
        },
        {
            "entity": "Frequency",
            "description": "The number of times specific responses were recorded."
        },
        {
            "entity": "Percentage",
            "description": "The percentage representation of specific responses among all responses."
        }
    ],
    "relationships": [
        {
            "relationship": "hasResponseType",
            "source_entity": "YETLKNON",
            "target_entity": "Response",
            "description": "Associates the survey question about having nobody to talk to with a response type."
        },
        {
            "relationship": "hasAbsentResponse",
            "source_entity": "YETLKNON",
            "target_entity": "ResponseNotEntered",
            "description": "Indicates whether the respondent did not provide a response for the item about having nobody to talk to."
        },
        {
            "relationship": "hasResponseCode",
            "source_entity": "Response",
            "target_entity": "ResponseCodes",
            "description": "Links a specific response to its categorized response codes."
        },
        {
            "relationship": "hasFrequency",
            "source_entity": "ResponseCodes",
            "target_entity": "Frequency",
            "description": "Indicates the frequency of a specific response code."
        },
        {
            "relationship": "hasPercentage",
            "source_entity": "ResponseCodes",
            "target_entity": "Percentage",
            "description": "Indicates the percentage of a specific response code among all responses."
        }
    ]
}