{
    "entities": [
        {
            "entity": "MentalHealthServiceUtilization",
            "description": "The utilization of professional counseling, medication, or other treatment for mental health, emotions, or behavior during the past 12 months."
        },
        {
            "entity": "FeelNeedForTreatment",
            "description": "The thought or feeling that a person should get professional counseling, medication, or other treatment for mental health, emotions, or behavior during the past 12 months."
        },
        {
            "entity": "UnmetTreatmentNeed",
            "description": "The reasons why a person did not get additional professional counseling, medication, or other treatment for mental health, emotions, or behavior."
        },
        {
            "entity": "HighCostOfTreatment",
            "description": "The perception that mental health treatment cost too much, resulting in unmet treatment needs."
        },
        {
            "entity": "NoHealthInsurance",
            "description": "The lack of health insurance coverage for mental health treatment, resulting in unmet treatment needs."
        }
    ],
    "relationships": [
        {
            "relationship": "hasUtilizedService",
            "source_entity": "Respondent",
            "target_entity": "MentalHealthServiceUtilization",
            "description": "Indicates whether the respondent utilized mental health services during the past 12 months."
        },
        {
            "relationship": "hasFeltNeedForTreatment",
            "source_entity": "Respondent",
            "target_entity": "FeelNeedForTreatment",
            "description": "Indicates whether the respondent felt the need for mental health treatment but did not receive it."
        },
        {
            "relationship": "hasUnmetTreatmentNeed",
            "source_entity": "Respondent",
            "target_entity": "UnmetTreatmentNeed",
            "description": "Indicates the reasons why the respondent did not get additional mental health treatment."
        },
        {
            "relationship": "hasHighCostOfTreatment",
            "source_entity": "UnmetTreatmentNeed",
            "target_entity": "HighCostOfTreatment",
            "description": "Indicates that the high cost of treatment was a reason for unmet mental health treatment needs."
        },
        {
            "relationship": "hasNoHealthInsurance",
            "source_entity": "UnmetTreatmentNeed",
            "target_entity": "NoHealthInsurance",
            "description": "Indicates that the lack of health insurance coverage was a reason for unmet mental health treatment needs."
        }
    ]
}