{
    "entities": [
        {
            "entity": "K6 Scale Total Score",
            "description": "A score variable ranging from 0 to 24 indicating the level of psychological distress during the worst month in the past year, excluding the past 30 days."
        },
        {
            "entity": "Frequency of Symptoms",
            "description": "A series of six questions asking respondents how frequently they experienced symptoms of psychological distress during their worst month of the past year."
        },
        {
            "entity": "Psychological Distress",
            "description": "Symptoms include feeling nervous, hopeless, restless or fidgety, so sad or depressed that nothing could cheer them up, feeling everything was an effort, and feelings of worthlessness."
        },
        {
            "entity": "WHO-DAS Total Score",
            "description": "A score variable ranging from 0 to 24, representing a measure of how much difficulty the respondent had in performing daily activities due to problems with emotions, nerves, or mental health."
        },
        {
            "entity": "Alternative WHO-DAS Score",
            "description": "An alternative score variable ranging from 0 to 8, representing a measure of difficulty the respondent had with daily activities due to emotions, nerves, or mental health."
        }
    ],
    "relationships": [
        {
            "relationship": "measuresDistress",
            "source_entity": "K6 Scale Total Score",
            "target_entity": "Psychological Distress",
            "description": "Indicates the level of psychological distress during the worst month in the past year."
        },
        {
            "relationship": "relatedToSymptoms",
            "source_entity": "K6 Scale Total Score",
            "target_entity": "Frequency of Symptoms",
            "description": "Related to the frequency of six specific symptoms of psychological distress during the worst month of the past year."
        },
        {
            "relationship": "derivedFromK6Score",
            "source_entity": "WHO-DAS Total Score",
            "target_entity": "K6 Scale Total Score",
            "description": "Derived based on the K6 score if the respondent experienced significant distress."
        },
        {
            "relationship": "alternativeToWhoDas",
            "source_entity": "Alternative WHO-DAS Score",
            "target_entity": "WHO-DAS Total Score",
            "description": "An alternative measure of difficulty in daily activities due to emotions, nerves, or mental health."
        }
    ]
}