{
    "entities": [
        {
            "entity": "Survey",
            "description": "A systematic collection of data regarding the use of various substances and mental health status among the population."
        },
        {
            "entity": "DrugUse",
            "description": "The consumption of illegal drugs, prescription medications, and other substances that can affect mental health."
        },
        {
            "entity": "MentalHealth",
            "description": "A person's condition regarding their psychological and emotional well-being."
        },
        {
            "entity": "SubstanceAbuse",
            "description": "The overuse or dependence on a substance leading to adverse effects on the individual's life."
        },
        {
            "entity": "Resilience",
            "description": "The capacity to recover quickly from difficulties or adapt to significant stress and adversity."
        },
        {
            "entity": "Infrastructure",
            "description": "The fundamental facilities and systems serving a country, city, and other areas, including transportation, communication systems, and public institutions."
        },
        {
            "entity": "Education",
            "description": "The process of facilitating learning, or the acquisition of knowledge, skills, and habits in various settings including schools."
        },
        {
            "entity": "Law",
            "description": "The system of rules that a particular country or community recognizes as regulating the actions of its members."
        },
        {
            "entity": "EconomicStatus",
            "description": "An individual's or family's economic and social position in relation to others, based on income, education, and occupation."
        },
        {
            "entity": "RuralArea",
            "description": "Regions located outside towns and cities which are often characterized by a lower population density and larger open spaces."
        }
    ],
    "relationships": [
        {
            "relationship": "hasComponent",
            "source_entity": "Survey",
            "target_entity": "DrugUse",
            "description": "The survey includes components related to the use of illegal and legal drugs."
        },
        {
            "relationship": "assesses",
            "source_entity": "Survey",
            "target_entity": "MentalHealth",
            "description": "The survey assesses the mental health status of participants."
        },
        {
            "relationship": "reports",
            "source_entity": "Survey",
            "target_entity": "SubstanceAbuse",
            "description": "The survey reports on various aspects of substance abuse within the population."
        },
        {
            "relationship": "enhances",
            "source_entity": "Resilience",
            "target_entity": "MentalHealth",
            "description": "Resilience can enhance an individual's mental health by providing the capacity to withstand stress."
        },
        {
            "relationship": "provides",
            "source_entity": "Infrastructure",
            "target_entity": "RuralArea",
            "description": "Infrastructure provides essential services ad facilities in rural areas."
        },
        {
            "relationship": "supports",
            "source_entity": "Education",
            "target_entity": "Resilience",
            "description": "Education supports the building of resilience in individuals by providing knowledge and skills."
        },
        {
            "relationship": "regulates",
            "source_entity": "Law",
            "target_entity": "SubstanceAbuse",
            "description": "Laws regulate substance abuse by setting legal boundaries for the use of various substances."
        },
        {
            "relationship": "influences",
            "source_entity": "EconomicStatus",
            "target_entity": "MentalHealth",
            "description": "Economic status can influence an individual’s mental health either positively or negatively."
        },
        {
            "relationship": "characterizes",
            "source_entity": "RuralArea",
            "target_entity": "EconomicStatus",
            "description": "The economic status of individuals living in rural areas often characterizes the region."
        }
    ]
}