{
    "entities": [
        {
            "entity": "SUD",
            "description": "Substance use disorder based on DSM-5 criteria using combinations of 'ANY' SUD variables."
        },
        {
            "entity": "ANY SUD Variables",
            "description": "Variables indicating overall SUD (i.e., disorder, no disorder) based on DSM-5 criteria."
        },
        {
            "entity": "SUD Summary Variables",
            "description": "Variables that incorporate prescription drug use disorder from respondents with any use of prescription drugs."
        },
        {
            "entity": "UD5ILLANY",
            "description": "Drug use disorder including prescription drug use disorder due to any use of prescription drugs."
        },
        {
            "entity": "UD5IEMANY",
            "description": "Drug use disorder including prescription drug use disorder due to any use of drugs other than marijuana."
        },
        {
            "entity": "UD5ILLALANY",
            "description": "Drug use disorder including prescription drug use disorder due to any use of prescription drugs, or alcohol use disorder."
        },
        {
            "entity": "UD5PSYANY",
            "description": "Prescription psychotherapeutic use disorder including prescription psychotherapeutic use disorder due to any use of prescription drugs."
        },
        {
            "entity": "UD5TRQSDANY",
            "description": "Prescription tranquilizer or sedative use disorder including prescription tranquilizer or sedative use disorder due to any use of tranquilizers or sedatives."
        },
        {
            "entity": "UD5OPIANY",
            "description": "Prescription opioid use disorder including prescription pain reliever use disorder due to any use of pain relievers; the opioid use disorder estimates do not capture symptoms that arose solely from the use of illegally made fentanyl."
        }
    ],
    "relationships": [
        {
            "relationship": "hasANYVariables",
            "source_entity": "SUD",
            "target_entity": "ANY SUD Variables",
            "description": "Indicates that SUD is based on combinations of 'ANY' SUD variables."
        },
        {
            "relationship": "incorporatesUseDisorder",
            "source_entity": "SUD Summary Variables",
            "target_entity": "Prescription Drug Use Disorder",
            "description": "Incorporates prescription drug use disorder from respondents with any use of prescription drugs."
        },
        {
            "relationship": "includesVariable",
            "source_entity": "ANY SUD Variables",
            "target_entity": "UD5ILLANY",
            "description": "Includes the variable UD5ILLANY for drug use disorder due to any use of prescription drugs."
        },
        {
            "relationship": "includesVariable",
            "source_entity": "ANY SUD Variables",
            "target_entity": "UD5IEMANY",
            "description": "Includes the variable UD5IEMANY for drug use disorder due to any use of drugs other than marijuana."
        },
        {
            "relationship": "includesVariable",
            "source_entity": "ANY SUD Variables",
            "target_entity": "UD5ILLALANY",
            "description": "Includes the variable UD5ILLALANY for drug use disorder including prescription drug use disorder or alcohol use disorder."
        },
        {
            "relationship": "includesVariable",
            "source_entity": "ANY SUD Variables",
            "target_entity": "UD5PSYANY",
            "description": "Includes the variable UD5PSYANY for prescription psychotherapeutic use disorder."
        },
        {
            "relationship": "includesVariable",
            "source_entity": "ANY SUD Variables",
            "target_entity": "UD5TRQSDANY",
            "description": "Includes the variable UD5TRQSDANY for prescription tranquilizer or sedative use disorder."
        },
        {
            "relationship": "includesVariable",
            "source_entity": "ANY SUD Variables",
            "target_entity": "UD5OPIANY",
            "description": "Includes the variable UD5OPIANY for prescription opioid use disorder."
        }
    ]
}