{
    "entities": [
        {
            "entity": "NSDUH",
            "description": "National Survey on Drug Use and Health, providing statistical information on substance use, mental health issues, and related topics among the civilian, noninstitutionalized population aged 12 or older in the United States."
        },
        {
            "entity": "SAMHSA",
            "description": "Substance Abuse and Mental Health Services Administration, the sponsor of the NSDUH."
        },
        {
            "entity": "RTI International",
            "description": "The organization conducting the NSDUH, based in Research Triangle Park, North Carolina."
        },
        {
            "entity": "SubstanceUseDisorder",
            "description": "Disorders related to the use of tobacco, alcohol, prescription psychotherapeutic drugs, and other substances like marijuana, cocaine, etc."
        },
        {
            "entity": "MentalHealthIssue",
            "description": "Mental health issues and conditions that are captured through the NSDUH survey."
        },
        {
            "entity": "SurveyCoverage",
            "description": "Population coverage of the NSDUH which includes individuals aged 12 or older in the civilian, noninstitutionalized U.S. population."
        },
        {
            "entity": "ConfidentialityProcedure",
            "description": "Procedures implemented to ensure the confidentiality and quality of data in the NSDUH."
        },
        {
            "entity": "PrecisionBasedSuppression",
            "description": "Encouraging users to apply precision-based suppression rules to avoid making decisions based on unreliable estimates."
        }
    ],
    "relationships": [
        {
            "relationship": "isSponsoredBy",
            "source_entity": "NSDUH",
            "target_entity": "SAMHSA",
            "description": "The NSDUH is sponsored by the Substance Abuse and Mental Health Services Administration."
        },
        {
            "relationship": "isConductedBy",
            "source_entity": "NSDUH",
            "target_entity": "RTI International",
            "description": "The NSDUH is conducted by RTI International."
        },
        {
            "relationship": "coversPopulation",
            "source_entity": "NSDUH",
            "target_entity": "SurveyCoverage",
            "description": "The NSDUH covers individuals aged 12 or older in the civilian, noninstitutionalized U.S. population."
        },
        {
            "relationship": "includesDataOn",
            "source_entity": "NSDUH",
            "target_entity": "SubstanceUseDisorder",
            "description": "The NSDUH includes data on substance use disorders."
        },
        {
            "relationship": "includesDataOn",
            "source_entity": "NSDUH",
            "target_entity": "MentalHealthIssue",
            "description": "The NSDUH includes data on mental health issues."
        },
        {
            "relationship": "ensures",
            "source_entity": "NSDUH",
            "target_entity": "ConfidentialityProcedure",
            "description": "The NSDUH ensures the confidentiality and quality of data through implemented procedures."
        },
        {
            "relationship": "encourages",
            "source_entity": "NSDUH",
            "target_entity": "PrecisionBasedSuppression",
            "description": "The NSDUH encourages users to apply precision-based suppression to avoid unreliable estimates."
        }
    ]
}