{
    "entities": [
        {
            "entity": "FeelControlOverSmoking",
            "description": "Sense of control over smoking, ranging from not at all true to extremely true."
        },
        {
            "entity": "AvoidPlacesNoSmoking",
            "description": "Tendency to avoid places that don't allow smoking."
        },
        {
            "entity": "FriendsNotSmoke",
            "description": "Having friends who do not smoke cigarettes."
        },
        {
            "entity": "AvoidFriendsNotSmoke",
            "description": "Choosing not to be around friends who don't smoke."
        }
    ],
    "relationships": [
        {
            "relationship": "hasControlOverSmoking",
            "source_entity": "Respondent",
            "target_entity": "FeelControlOverSmoking",
            "description": "Indicates the respondent's sense of control over their smoking habits."
        },
        {
            "relationship": "hasAvoidanceBehavior",
            "source_entity": "Respondent",
            "target_entity": "AvoidPlacesNoSmoking",
            "description": "Indicates the respondent's tendency to avoid places where smoking is not allowed."
        },
        {
            "relationship": "hasFriends",
            "source_entity": "Respondent",
            "target_entity": "FriendsNotSmoke",
            "description": "Indicates whether the respondent has friends who do not smoke."
        },
        {
            "relationship": "hasAvoidanceOfFriends",
            "source_entity": "Respondent",
            "target_entity": "AvoidFriendsNotSmoke",
            "description": "Indicates the respondent's behavior of avoiding friends who don't smoke."
        }
    ],
    "triplets": [
        {
            "subject": "FeelControlOverSmoking",
            "predicate": "hasFrequency",
            "object": "1943 Not at all true, 1864 Somewhat true, 1177 Moderately true, 985 Very true, 1121 Extremely true, 5 BAD DATA Logically assigned, 34135 NEVER USED CIGARETTES, 17709 DID NOT USE CIGARETTES IN THE PAST 30 DAYS, 94 DON'T KNOW, 18 REFUSED, 96 BLANK (NO ANSWER)"
        },
        {
            "subject": "AvoidPlacesNoSmoking",
            "predicate": "hasFrequency",
            "object": "4702 Not at all true, 1092 Somewhat true, 691 Moderately true, 373 Very true, 292 Extremely true, 5 BAD DATA Logically assigned, 34135 NEVER USED CIGARETTES, 17709 DID NOT USE CIGARETTES IN THE PAST 30 DAYS, 19 DON'T KNOW, 18 REFUSED, 96 BLANK (NO ANSWER)"
        },
        {
            "subject": "FriendsNotSmoke",
            "predicate": "hasFrequency",
            "object": "6526 Yes, 579 No, 5 BAD DATA Logically assigned, 34135 NEVER USED CIGARETTES, 17709 DID NOT USE CIGARETTES IN THE PAST 30 DAYS, 94 DON'T KNOW, 12 REFUSED, 97 BLANK (NO ANSWER)"
        },
        {
            "subject": "AvoidFriendsNotSmoke",
            "predicate": "hasFrequency",
            "object": "5090 Not at all true, 706 Somewhat true, 370 Moderately true, 212 Very true, 129 Extremely true, 24 BAD DATA Logically assigned, 34135 NEVER USED CIGARETTES, 17709 DID NOT USE CIGARETTES IN THE PAST 30 DAYS, 94 DON'T KNOW, 22 REFUSED, 107 BLANK (NO ANSWER), 579 LEGITIMATE SKIP"
        }
    ]
}