{
    "entities": [
        {
            "entity": "RC-YOUTH: SAW/TALK TO ANOTHER HEALTH ABOUT MDE IN PY",
            "description": "Indicates whether a youth reported seeing or talking to another health professional about MDE in the past year."
        },
        {
            "entity": "YHLTMDE",
            "description": "Indicates whether a youth reported seeing or talking to a health professional about MDE in the past year."
        },
        {
            "entity": "YHTMDE",
            "description": "Indicates whether a youth reported seeing or talking to all of the professionals listed in the survey about MDE in the past year."
        },
        {
            "entity": "YALTDEMDER",
            "description": "Indicates whether a youth reported seeing or talking to an alternative service professional about MDE in the past year."
        },
        {
            "entity": "YMDERX02",
            "description": "Indicates whether a youth received prescription medication and no health professional for MDE in the past year."
        },
        {
            "entity": "YMDEHPO",
            "description": "Indicates whether a youth saw a health professional only for MDE in the past year."
        },
        {
            "entity": "YMDEHRX",
            "description": "Indicates whether a youth saw a health professional or received prescription medication for MDE in the past year."
        }
    ],
    "relationships": [
        {
            "relationship": "hasYHLTMDE",
            "source_entity": "YHLTMDE",
            "target_entity": "Survey Question",
            "description": "Links YHLTMDE to the survey question about seeing/talking to a health professional for MDE in the past year."
        },
        {
            "relationship": "hasYHTMDE",
            "source_entity": "YHTMDE",
            "target_entity": "Survey Question",
            "description": "Links YHTMDE to the survey question about seeing/talking to all listed health professionals for MDE in the past year."
        },
        {
            "relationship": "hasYALTDEMDER",
            "source_entity": "YALTDEMDER",
            "target_entity": "Survey Question",
            "description": "Links YALTDEMDER to the survey question about seeing/talking to alternative service professionals for MDE in the past year."
        },
        {
            "relationship": "hasYMDERX02",
            "source_entity": "YMDERX02",
            "target_entity": "Survey Question",
            "description": "Links YMDERX02 to the survey question about receiving prescription medication and no health professional for MDE in the past year."
        },
        {
            "relationship": "hasYMDEHPO",
            "source_entity": "YMDEHPO",
            "target_entity": "Survey Question",
            "description": "Links YMDEHPO to the survey question about seeing a health professional only for MDE in the past year."
        },
        {
            "relationship": "hasYMDEHRX",
            "source_entity": "YMDEHRX",
            "target_entity": "Survey Question",
            "description": "Links YMDEHRX to the survey question about seeing a health professional or receiving prescription medication for MDE in the past year."
        }
    ]
}