{
    "entities": [
        {
            "entity": "SurveyPeriod",
            "description": "The time frame of the past 30 days, including today's date."
        },
        {
            "entity": "SickOrInjuredDays",
            "description": "Number of whole days missed from school due to sickness or injury."
        },
        {
            "entity": "SchoolAbsenceReason",
            "description": "The reason for missing school, specifically due to being sick or injured."
        },
        {
            "entity": "FamilyCareAbsence",
            "description": "Number of days missed due to staying home with a sick child or family member."
        },
        {
            "entity": "Anti-White",
            "description": "Incidents motivated by bias against White individuals."
        },
        {
            "entity": "Anti-BlackOrAfricanAmerican",
            "description": "Incidents motivated by bias against Black or African American individuals."
        },
        {
            "entity": "Anti-AmericanIndianOrAlaskaNative",
            "description": "Incidents motivated by bias against American Indian or Alaska Native individuals."
        },
        {
            "entity": "Anti-Asian",
            "description": "Incidents motivated by bias against Asian individuals."
        },
        {
            "entity": "Anti-MultiRacialGroup",
            "description": "Incidents motivated by bias against multi-racial groups."
        },
        {
            "entity": "Anti-NativeHawaiianOrPacificIslander",
            "description": "Incidents motivated by bias against Native Hawaiian or Other Pacific Islander individuals."
        },
        {
            "entity": "Anti-Jewish",
            "description": "Incidents motivated by bias against Jewish individuals."
        },
        {
            "entity": "Anti-Catholic",
            "description": "Incidents motivated by bias against Catholic individuals."
        },
        {
            "entity": "Anti-Protestant",
            "description": "Incidents motivated by bias against Protestant individuals."
        },
        {
            "entity": "Anti-Islamic",
            "description": "Incidents motivated by bias against Islamic (Muslim) individuals."
        },
        {
            "entity": "Anti-OtherReligion",
            "description": "Incidents motivated by bias against individuals of other religions."
        },
        {
            "entity": "Anti-MultiReligiousGroup",
            "description": "Incidents motivated by bias against multiple religious groups."
        },
        {
            "entity": "Anti-AtheismOrAgnosticism",
            "description": "Incidents motivated by bias against atheism or agnosticism."
        },
        {
            "entity": "Anti-Mormon",
            "description": "Incidents motivated by bias against Mormon individuals."
        },
        {
            "entity": "Anti-JehovahsWitness",
            "description": "Incidents motivated by bias against Jehovah's Witnesses."
        },
        {
            "entity": "Anti-Arab",
            "description": "Incidents motivated by bias against Arab individuals."
        },
        {
            "entity": "Anti-HispanicOrLatino",
            "description": "Incidents motivated by bias against Hispanic or Latino individuals."
        },
        {
            "entity": "Anti-NotHispanicOrLatino",
            "description": "Incidents motivated by bias against individuals not identified as Hispanic or Latino."
        },
        {
            "entity": "Anti-Gay",
            "description": "Incidents motivated by bias against gay individuals."
        },
        {
            "entity": "Anti-Lesbian",
            "description": "Incidents motivated by bias against lesbian individuals."
        },
        {
            "entity": "Anti-LGBT",
            "description": "Incidents motivated by bias against Lesbian, Gay, Bisexual, or Transgender individuals."
        },
        {
            "entity": "Anti-Heterosexual",
            "description": "Incidents motivated by bias against heterosexual individuals."
        },
        {
            "entity": "Anti-Bisexual",
            "description": "Incidents motivated by bias against bisexual individuals."
        },
        {
            "entity": "Anti-PhysicalDisability",
            "description": "Incidents motivated by bias against individuals with physical disabilities."
        },
        {
            "entity": "Anti-MentalDisability",
            "description": "Incidents motivated by bias against individuals with mental disabilities."
        },
        {
            "entity": "Anti-Male",
            "description": "Incidents motivated by bias against male individuals."
        },
        {
            "entity": "Anti-Female",
            "description": "Incidents motivated by bias against female individuals."
        },
        {
            "entity": "Anti-Transgender",
            "description": "Incidents motivated by bias against transgender individuals."
        },
        {
            "entity": "Anti-GenderNonConforming",
            "description": "Incidents motivated by bias against gender non-conforming individuals."
        }
    ]
}